#! --*-- coding: utf-8 --*--

"""
打印 int 的32位 信息
"""


def print32(num):
    bit_list = []
    for i in range(31, -1, -1):
        bit_num = '0' if (num & (1 << i)) == 0 else '1'
        bit_list.append(bit_num)
    print ''.join(bit_list)

"""
数字在计算机中的编码存储
第1位 为符号位 0:正数, 1:负数
正数  1:  00000000000000000000000000000001
负数采用补码存储(补码 = 数字位取反 + 1)
负数  -1: 11111111111111111111111111111111

负数 补码 转换
负数          10000000000000000000000000000001
数字位取反     11111111111111111111111111111110
补码          11111111111111111111111111111111
"""


if __name__ == "__main__":
    print32(1)
    print32(0)
    print32(-1)